Karin001/youbeng_can/Project_Headers/mc9s12zvmc128.h
extern volatile PMFDMP4STR _PMFDMP4 @0x0000053C;
#define PMFDMP4                         _PMFDMP4.Byte
#define PMFDMP4_DMP40                   _PMFDMP4.Bits.DMP40
#define PMFDMP4_DMP41                   _PMFDMP4.Bits.DMP41
#define PMFDMP4_DMP42                   _PMFDMP4.Bits.DMP42
#define PMFDMP4_DMP43                   _PMFDMP4.Bits.DMP43
#define PMFDMP4_DMP44                   _PMFDMP4.Bits.DMP44
#define PMFDMP4_DMP45                   _PMFDMP4.Bits.DMP45
#define PMFDMP4_DMP_40                  _PMFDMP4.MergedBits.grpDMP_40
#define PMFDMP4_DMP                     PMFDMP4_DMP_40

#define PMFDMP4_DMP40_MASK              1U
#define PMFDMP4_DMP41_MASK              2U
#define PMFDMP4_DMP42_MASK              4U
#define PMFDMP4_DMP43_MASK              8U
#define PMFDMP4_DMP44_MASK              48U
#define PMFDMP4_DMP44_BITNUM            4U
#define PMFDMP4_DMP45_MASK              192U
#define PMFDMP4_DMP45_BITNUM            6U
#define PMFDMP4_DMP_40_MASK             15U
#define PMFDMP4_DMP_40_BITNUM           0U


/*** PMFDMP5 - PMF Disable Mapping Register 5; 0x0000053D ***/
typedef union {
  byte Byte;
  struct {
    byte DMP50       :1;                                       /* PWM Disable Mapping Channel 5 FAULT0 */
    byte DMP51       :1;                                       /* PWM Disable Mapping Channel 5 FAULT1 */
    byte DMP52       :1;                                       /* PWM Disable Mapping Channel 5 FAULT2 */
    byte DMP53       :1;                                       /* PWM Disable Mapping Channel 5 FAULT3 */
    byte DMP54       :2;                                       /* PWM Disable Mapping Channel 5 FAULT4 */
    byte DMP55       :2;                                       /* PWM Disable Mapping Channel 5 FAULT5 */
  } Bits;
  struct {
    byte grpDMP_50 :4;
    byte         :2;
    byte         :2;
  } MergedBits;
} PMFDMP5STR;
extern volatile PMFDMP5STR _PMFDMP5 @0x0000053D;
#define PMFDMP5                         _PMFDMP5.Byte
#define PMFDMP5_DMP50                   _PMFDMP5.Bits.DMP50
#define PMFDMP5_DMP51                   _PMFDMP5.Bits.DMP51
#define PMFDMP5_DMP52                   _PMFDMP5.Bits.DMP52
#define PMFDMP5_DMP53                   _PMFDMP5.Bits.DMP53
#define PMFDMP5_DMP54                   _PMFDMP5.Bits.DMP54
#define PMFDMP5_DMP55                   _PMFDMP5.Bits.DMP55
#define PMFDMP5_DMP_50                  _PMFDMP5.MergedBits.grpDMP_50
#define PMFDMP5_DMP                     PMFDMP5_DMP_50

#define PMFDMP5_DMP50_MASK              1U
#define PMFDMP5_DMP51_MASK              2U
#define PMFDMP5_DMP52_MASK              4U
#define PMFDMP5_DMP53_MASK              8U
#define PMFDMP5_DMP54_MASK              48U
#define PMFDMP5_DMP54_BITNUM            4U
#define PMFDMP5_DMP55_MASK              192U
#define PMFDMP5_DMP55_BITNUM            6U
#define PMFDMP5_DMP_50_MASK             15U
#define PMFDMP5_DMP_50_BITNUM           0U


/*** PMFOUTF - PMF Output Control on Fault Register; 0x0000053E ***/
typedef union {
  byte Byte;
  struct {
    byte OUTF0       :1;                                       /* OUTF Bit0 */
    byte OUTF1       :1;                                       /* OUTF Bit1 */
    byte OUTF2       :1;                                       /* OUTF Bit2 */
    byte OUTF3       :1;                                       /* OUTF Bit3 */
    byte OUTF4       :1;                                       /* OUTF Bit4 */
    byte OUTF5       :1;                                       /* OUTF Bit5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpOUTF :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PMFOUTFSTR;
extern volatile PMFOUTFSTR _PMFOUTF @0x0000053E;
#define PMFOUTF                         _PMFOUTF.Byte
#define PMFOUTF_OUTF0                   _PMFOUTF.Bits.OUTF0
#define PMFOUTF_OUTF1                   _PMFOUTF.Bits.OUTF1
#define PMFOUTF_OUTF2                   _PMFOUTF.Bits.OUTF2
#define PMFOUTF_OUTF3                   _PMFOUTF.Bits.OUTF3
#define PMFOUTF_OUTF4                   _PMFOUTF.Bits.OUTF4
#define PMFOUTF_OUTF5                   _PMFOUTF.Bits.OUTF5
#define PMFOUTF_OUTF                    _PMFOUTF.MergedBits.grpOUTF

#define PMFOUTF_OUTF0_MASK              1U
#define PMFOUTF_OUTF1_MASK              2U
#define PMFOUTF_OUTF2_MASK              4U
#define PMFOUTF_OUTF3_MASK              8U
#define PMFOUTF_OUTF4_MASK              16U
#define PMFOUTF_OUTF5_MASK              32U
#define PMFOUTF_OUTF_MASK               63U
#define PMFOUTF_OUTF_BITNUM             0U


/*** PTUE - PTU Enable Register; 0x00000580 ***/
typedef union {
  byte Byte;
  struct {
    byte TG0EN       :1;                                       /* Trigger Generator 0 Enable */
    byte TG1EN       :1;                                       /* Trigger Generator 1 Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTUFRZ      :1;                                       /* PTU Stop in Freeze Mode */
    byte             :1; 
  } Bits;
} PTUESTR;
extern volatile PTUESTR _PTUE @0x00000580;
#define PTUE                            _PTUE.Byte
#define PTUE_TG0EN                      _PTUE.Bits.TG0EN
#define PTUE_TG1EN                      _PTUE.Bits.TG1EN
#define PTUE_PTUFRZ                     _PTUE.Bits.PTUFRZ

#define PTUE_TG0EN_MASK                 1U
#define PTUE_TG1EN_MASK                 2U
#define PTUE_PTUFRZ_MASK                64U


/*** PTUC - PTU Module Control Register; 0x00000581 ***/
typedef union {
  byte Byte;
  struct {
    byte PTULDOK     :1;                                       /* Load Okay */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} PTUCSTR;
extern volatile PTUCSTR _PTUC @0x00000581;
#define PTUC                            _PTUC.Byte
#define PTUC_PTULDOK                    _PTUC.Bits.PTULDOK

#define PTUC_PTULDOK_MASK               1U


/*** PTUIEH - PTU Interrupt Enable Register High; 0x00000582 ***/
typedef union {
  byte Byte;
  struct {
    byte PTUROIE     :1;                                       /* PTU Reload Overrun Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} PTUIEHSTR;
extern volatile PTUIEHSTR _PTUIEH @0x00000582;
#define PTUIEH                          _PTUIEH.Byte
#define PTUIEH_PTUROIE                  _PTUIEH.Bits.PTUROIE

#define PTUIEH_PTUROIE_MASK             1U


/*** PTUIEL - PTU Interrupt Enable Register Low; 0x00000583 ***/
typedef union {
  byte Byte;
  struct {
    byte TG0DIE      :1;                                       /* Trigger Generator 0 Done Interrupt Enable */
    byte TG0TEIE     :1;                                       /* Trigger Generator 0 Timing Error Interrupt Enable */
    byte TG0REIE     :1;                                       /* Trigger Generator 0 Reload Error Interrupt Enable */
    byte TG0AEIE     :1;                                       /* Trigger Generator 0 Memory Access Error Interrupt Enable */
    byte TG1DIE      :1;                                       /* Trigger Generator 1 Done Interrupt Enable */
    byte TG1TEIE     :1;                                       /* Trigger Generator 1 Timing Error Interrupt Enable */
    byte TG1REIE     :1;                                       /* Trigger Generator 1 Reload Error Interrupt Enable */
    byte TG1AEIE     :1;                                       /* Trigger Generator 1 Memory Access Error Interrupt Enable */
  } Bits;
} PTUIELSTR;
extern volatile PTUIELSTR _PTUIEL @0x00000583;
#define PTUIEL                          _PTUIEL.Byte
#define PTUIEL_TG0DIE                   _PTUIEL.Bits.TG0DIE
#define PTUIEL_TG0TEIE                  _PTUIEL.Bits.TG0TEIE
#define PTUIEL_TG0REIE                  _PTUIEL.Bits.TG0REIE
#define PTUIEL_TG0AEIE                  _PTUIEL.Bits.TG0AEIE
#define PTUIEL_TG1DIE                   _PTUIEL.Bits.TG1DIE
#define PTUIEL_TG1TEIE                  _PTUIEL.Bits.TG1TEIE
#define PTUIEL_TG1REIE                  _PTUIEL.Bits.TG1REIE
#define PTUIEL_TG1AEIE                  _PTUIEL.Bits.TG1AEIE

#define PTUIEL_TG0DIE_MASK              1U
#define PTUIEL_TG0TEIE_MASK             2U
#define PTUIEL_TG0REIE_MASK             4U
#define PTUIEL_TG0AEIE_MASK             8U
#define PTUIEL_TG1DIE_MASK              16U
#define PTUIEL_TG1TEIE_MASK             32U
#define PTUIEL_TG1REIE_MASK             64U
#define PTUIEL_TG1AEIE_MASK             128U


