Karin001/youbeng_can/Project_Headers/mc9s12zvmc128.h
  /* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (CPMUARMCOP = 0x55U, CPMUARMCOP = 0xAAU)
#endif
#endif /* __RESET_WATCHDOG */


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */



/* **** 1/12/2012 2:56:03 PM */

#define ECCADDRH                         This_symb_has_been_depreciated
#define ECCADDRH_ECCADDR                 This_symb_has_been_depreciated
#define ECCADDRH_ECCADDR_MASK            This_symb_has_been_depreciated
#define ECCADDRH_ECCADDR_BITNUM          This_symb_has_been_depreciated
#define ECCADDRM                         This_symb_has_been_depreciated
#define ECCADDRM_ECCADDR                 This_symb_has_been_depreciated
#define ECCADDRM_ECCADDR_MASK            This_symb_has_been_depreciated
#define ECCADDRM_ECCADDR_BITNUM          This_symb_has_been_depreciated
#define ECCADDRL                         This_symb_has_been_depreciated
#define ECCADDRL_ECCADDR                 This_symb_has_been_depreciated
#define ECCADDRL_ECCADDR_MASK            This_symb_has_been_depreciated
#define ECCADDRL_ECCADDR_BITNUM          This_symb_has_been_depreciated
#define DBGAD                            DBGAD0
#define DBGADM                           DBGADM0
#define DBGCD                            DBGCD0
#define DBGCDM                           DBGCDM0
#define MODRR0_S0LRR                     MODRR0_S0L0RR
#define MODRR0_SPIRR                     MODRR0_SPI0RR
#define MODRR0_SPISSRR                   MODRR0_SPI0SSRR
#define MODRR0_S0LRR_MASK                MODRR0_S0L0RR_MASK
#define MODRR0_S0LRR_BITNUM              MODRR0_S0L0RR_BITNUM
#define MODRR0_SPIRR_MASK                MODRR0_SPI0RR_MASK
#define MODRR0_SPISSRR_MASK              MODRR0_SPI0SSRR_MASK
#define MODRR2_IC1RR                     MODRR2_T0IC1RR
#define MODRR2_IC3RR                     MODRR2_T0IC3RR
#define MODRR2_IC1RR_MASK                MODRR2_T0IC1RR_MASK
#define MODRR2_IC3RR_MASK                MODRR2_T0IC3RR_MASK
#define MODRR2_IC3RR_BITNUM              MODRR2_T0IC3RR_BITNUM
#define PMFCFG3_VLMODE0                  This_symb_has_been_depreciated
#define PMFCFG3_VLMODE1                  This_symb_has_been_depreciated
#define PMFCFG3_VLMODE0_MASK             This_symb_has_been_depreciated
#define PMFCFG3_VLMODE1_MASK             This_symb_has_been_depreciated
#define PMFCCTL_ISENS0                   This_symb_has_been_depreciated
#define PMFCCTL_ISENS1                   This_symb_has_been_depreciated
#define PMFCCTL_ISENS0_MASK              This_symb_has_been_depreciated
#define PMFCCTL_ISENS1_MASK              This_symb_has_been_depreciated
#define CPMURFLG_ILAF                    This_symb_has_been_depreciated
#define CPMURFLG_ILAF_MASK               This_symb_has_been_depreciated
#define _NVFPSTAT                        _PROTKEY
#define NVFPSTAT                         PROTKEY
#define NVFPSTAT_FPOVRD                  This_symb_has_been_depreciated
#define NVFPSTAT_FPOVRD_MASK             This_symb_has_been_depreciated

/* **** 9/05/2012 10:09:14 AM */
#define INT_XGPRIO                       This_symb_has_been_depreciated
#define INT_XGPRIO_XILVL                 This_symb_has_been_depreciated
#define INT_XGPRIO_XILVL_MASK            This_symb_has_been_depreciated
#define INT_XGPRIO_XILVL_BITNUM          This_symb_has_been_depreciated
#define INT_CFDATA0_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA1_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA2_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA3_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA4_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA5_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA6_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA7_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA0_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA1_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA2_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA3_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA4_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA5_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA6_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA7_RQST_MASK            This_symb_has_been_depreciated
#define FERCNFG_DFDIE                    This_symb_has_been_depreciated
#define FERCNFG_DFDIE_MASK               This_symb_has_been_depreciated
#define FERSTAT_DFDIF                    This_symb_has_been_depreciated
#define FERSTAT_DFDIF_MASK               This_symb_has_been_depreciated
#define GDUE_GCS0E                       This_symb_has_been_depreciated
#define GDUE_GCS1E                       This_symb_has_been_depreciated
#define GDUE_GCS0E_MASK                  This_symb_has_been_depreciated
#define GDUE_GCS1E_MASK                  This_symb_has_been_depreciated
#define GDUIE_GLVLSFIE                   This_symb_has_been_depreciated
#define GDUIE_GHHDFIE                    This_symb_has_been_depreciated
#define GDUIE_GLVLSFIE_MASK              This_symb_has_been_depreciated
#define GDUIE_GHHDFIE_MASK               This_symb_has_been_depreciated
#define GDUPHS                           This_symb_has_been_depreciated
#define GDUPHS_MASK                      This_symb_has_been_depreciated
#define GDUPHS_BITNUM                    This_symb_has_been_depreciated
#define GDUPHS_GPHS0                     This_symb_has_been_depreciated
#define GDUPHS_GPHS1                     This_symb_has_been_depreciated
#define GDUPHS_GPHS2                     This_symb_has_been_depreciated
#define GDUPHS_GPHS0_MASK                This_symb_has_been_depreciated
#define GDUPHS_GPHS1_MASK                This_symb_has_been_depreciated
#define GDUPHS_GPHS2_MASK                This_symb_has_been_depreciated
#define GDUCSO_GCS0O                     This_symb_has_been_depreciated
#define GDUCSO_GCS1O                     This_symb_has_been_depreciated
#define GDUCSO_GCS0O_MASK                This_symb_has_been_depreciated
#define GDUCSO_GCS1O_MASK                This_symb_has_been_depreciated
#define GDUCSO_GCS0O_BITNUM              This_symb_has_been_depreciated
#define GDUCSO_GCS1O_BITNUM              This_symb_has_been_depreciated
#define PTUE_PTUWP                       This_symb_has_been_depreciated
#define PTUE_PTUWP_MASK                  This_symb_has_been_depreciated

/* **** 1/25/2012 3:28:11 PM */

#define DBGAD0_BIT0                      DBGAD0_BIT24
#define DBGAD0_BIT1                      DBGAD0_BIT25
#define DBGAD0_BIT2                      DBGAD0_BIT26
#define DBGAD0_BIT3                      DBGAD0_BIT27
#define DBGAD0_BIT4                      DBGAD0_BIT28
#define DBGAD0_BIT5                      DBGAD0_BIT29
#define DBGAD0_BIT6                      DBGAD0_BIT30
#define DBGAD0_BIT7                      DBGAD0_BIT31
#define DBGAD0_BIT0_MASK                 DBGAD0_BIT24_MASK
#define DBGAD0_BIT1_MASK                 DBGAD0_BIT25_MASK
#define DBGAD0_BIT2_MASK                 DBGAD0_BIT26_MASK
#define DBGAD0_BIT3_MASK                 DBGAD0_BIT27_MASK
#define DBGAD0_BIT4_MASK                 DBGAD0_BIT28_MASK
#define DBGAD0_BIT5_MASK                 DBGAD0_BIT29_MASK
#define DBGAD0_BIT6_MASK                 DBGAD0_BIT30_MASK
#define DBGAD0_BIT7_MASK                 DBGAD0_BIT31_MASK
#define DBGAD1_BIT8                      DBGAD1_BIT16
#define DBGAD1_BIT9                      DBGAD1_BIT17
#define DBGAD1_BIT10                     DBGAD1_BIT18
#define DBGAD1_BIT11                     DBGAD1_BIT19
#define DBGAD1_BIT12                     DBGAD1_BIT20
#define DBGAD1_BIT13                     DBGAD1_BIT21
#define DBGAD1_BIT14                     DBGAD1_BIT22
#define DBGAD1_BIT15                     DBGAD1_BIT23
#define DBGAD1_BIT8_MASK                 DBGAD1_BIT16_MASK
#define DBGAD1_BIT9_MASK                 DBGAD1_BIT17_MASK
#define DBGAD1_BIT10_MASK                DBGAD1_BIT18_MASK
#define DBGAD1_BIT11_MASK                DBGAD1_BIT19_MASK
#define DBGAD1_BIT12_MASK                DBGAD1_BIT20_MASK
#define DBGAD1_BIT13_MASK                DBGAD1_BIT21_MASK
#define DBGAD1_BIT14_MASK                DBGAD1_BIT22_MASK
#define DBGAD1_BIT15_MASK                DBGAD1_BIT23_MASK
#define DBGAD2_BIT16                     DBGAD2_BIT8
#define DBGAD2_BIT17                     DBGAD2_BIT9
#define DBGAD2_BIT18                     DBGAD2_BIT10
#define DBGAD2_BIT19                     DBGAD2_BIT11
#define DBGAD2_BIT20                     DBGAD2_BIT12
#define DBGAD2_BIT21                     DBGAD2_BIT13
#define DBGAD2_BIT22                     DBGAD2_BIT14
#define DBGAD2_BIT23                     DBGAD2_BIT15
#define DBGAD2_BIT16_MASK                DBGAD2_BIT8_MASK
#define DBGAD2_BIT17_MASK                DBGAD2_BIT9_MASK
#define DBGAD2_BIT18_MASK                DBGAD2_BIT10_MASK
#define DBGAD2_BIT19_MASK                DBGAD2_BIT11_MASK
#define DBGAD2_BIT20_MASK                DBGAD2_BIT12_MASK
#define DBGAD2_BIT21_MASK                DBGAD2_BIT13_MASK
#define DBGAD2_BIT22_MASK                DBGAD2_BIT14_MASK
#define DBGAD2_BIT23_MASK                DBGAD2_BIT15_MASK
#define DBGAD3_BIT24                     DBGAD3_BIT0
#define DBGAD3_BIT25                     DBGAD3_BIT1
#define DBGAD3_BIT26                     DBGAD3_BIT2
#define DBGAD3_BIT27                     DBGAD3_BIT3
#define DBGAD3_BIT28                     DBGAD3_BIT4
#define DBGAD3_BIT29                     DBGAD3_BIT5
#define DBGAD3_BIT30                     DBGAD3_BIT6
#define DBGAD3_BIT31                     DBGAD3_BIT7
#define DBGAD3_BIT24_MASK                DBGAD3_BIT0_MASK
#define DBGAD3_BIT25_MASK                DBGAD3_BIT1_MASK
#define DBGAD3_BIT26_MASK                DBGAD3_BIT2_MASK
#define DBGAD3_BIT27_MASK                DBGAD3_BIT3_MASK
#define DBGAD3_BIT28_MASK                DBGAD3_BIT4_MASK
#define DBGAD3_BIT29_MASK                DBGAD3_BIT5_MASK
#define DBGAD3_BIT30_MASK                DBGAD3_BIT6_MASK
#define DBGAD3_BIT31_MASK                DBGAD3_BIT7_MASK
#define DBGADM0_BIT0                     DBGADM0_BIT24
#define DBGADM0_BIT1                     DBGADM0_BIT25
#define DBGADM0_BIT2                     DBGADM0_BIT26
#define DBGADM0_BIT3                     DBGADM0_BIT27
#define DBGADM0_BIT4                     DBGADM0_BIT28
#define DBGADM0_BIT5                     DBGADM0_BIT29
#define DBGADM0_BIT6                     DBGADM0_BIT30
#define DBGADM0_BIT7                     DBGADM0_BIT31
#define DBGADM0_BIT0_MASK                DBGADM0_BIT24_MASK
#define DBGADM0_BIT1_MASK                DBGADM0_BIT25_MASK
#define DBGADM0_BIT2_MASK                DBGADM0_BIT26_MASK
#define DBGADM0_BIT3_MASK                DBGADM0_BIT27_MASK
#define DBGADM0_BIT4_MASK                DBGADM0_BIT28_MASK
#define DBGADM0_BIT5_MASK                DBGADM0_BIT29_MASK
#define DBGADM0_BIT6_MASK                DBGADM0_BIT30_MASK
#define DBGADM0_BIT7_MASK                DBGADM0_BIT31_MASK
#define DBGADM1_BIT8                     DBGADM1_BIT16
#define DBGADM1_BIT9                     DBGADM1_BIT17
#define DBGADM1_BIT10                    DBGADM1_BIT18
#define DBGADM1_BIT11                    DBGADM1_BIT19
#define DBGADM1_BIT12                    DBGADM1_BIT20
#define DBGADM1_BIT13                    DBGADM1_BIT21
#define DBGADM1_BIT14                    DBGADM1_BIT22
#define DBGADM1_BIT15                    DBGADM1_BIT23
#define DBGADM1_BIT8_MASK                DBGADM1_BIT16_MASK
#define DBGADM1_BIT9_MASK                DBGADM1_BIT17_MASK
#define DBGADM1_BIT10_MASK               DBGADM1_BIT18_MASK
#define DBGADM1_BIT11_MASK               DBGADM1_BIT19_MASK
#define DBGADM1_BIT12_MASK               DBGADM1_BIT20_MASK
#define DBGADM1_BIT13_MASK               DBGADM1_BIT21_MASK
#define DBGADM1_BIT14_MASK               DBGADM1_BIT22_MASK
#define DBGADM1_BIT15_MASK               DBGADM1_BIT23_MASK
#define DBGADM2_BIT16                    DBGADM2_BIT8
#define DBGADM2_BIT17                    DBGADM2_BIT9
#define DBGADM2_BIT18                    DBGADM2_BIT10
#define DBGADM2_BIT19                    DBGADM2_BIT11
#define DBGADM2_BIT20                    DBGADM2_BIT12
#define DBGADM2_BIT21                    DBGADM2_BIT13
#define DBGADM2_BIT22                    DBGADM2_BIT14
#define DBGADM2_BIT23                    DBGADM2_BIT15
#define DBGADM2_BIT16_MASK               DBGADM2_BIT8_MASK
#define DBGADM2_BIT17_MASK               DBGADM2_BIT9_MASK
#define DBGADM2_BIT18_MASK               DBGADM2_BIT10_MASK
#define DBGADM2_BIT19_MASK               DBGADM2_BIT11_MASK
#define DBGADM2_BIT20_MASK               DBGADM2_BIT12_MASK
#define DBGADM2_BIT21_MASK               DBGADM2_BIT13_MASK
#define DBGADM2_BIT22_MASK               DBGADM2_BIT14_MASK
#define DBGADM2_BIT23_MASK               DBGADM2_BIT15_MASK
#define DBGADM3_BIT24                    DBGADM3_BIT0
#define DBGADM3_BIT25                    DBGADM3_BIT1
#define DBGADM3_BIT26                    DBGADM3_BIT2
#define DBGADM3_BIT27                    DBGADM3_BIT3
#define DBGADM3_BIT28                    DBGADM3_BIT4
#define DBGADM3_BIT29                    DBGADM3_BIT5
#define DBGADM3_BIT30                    DBGADM3_BIT6
#define DBGADM3_BIT31                    DBGADM3_BIT7
#define DBGADM3_BIT24_MASK               DBGADM3_BIT0_MASK
#define DBGADM3_BIT25_MASK               DBGADM3_BIT1_MASK
#define DBGADM3_BIT26_MASK               DBGADM3_BIT2_MASK
#define DBGADM3_BIT27_MASK               DBGADM3_BIT3_MASK
#define DBGADM3_BIT28_MASK               DBGADM3_BIT4_MASK
#define DBGADM3_BIT29_MASK               DBGADM3_BIT5_MASK
#define DBGADM3_BIT30_MASK               DBGADM3_BIT6_MASK
#define DBGADM3_BIT31_MASK               DBGADM3_BIT7_MASK
#define DBGCD0_BIT0                      DBGCD0_BIT24
#define DBGCD0_BIT1                      DBGCD0_BIT25
#define DBGCD0_BIT2                      DBGCD0_BIT26
#define DBGCD0_BIT3                      DBGCD0_BIT27
#define DBGCD0_BIT4                      DBGCD0_BIT28
#define DBGCD0_BIT5                      DBGCD0_BIT29
#define DBGCD0_BIT6                      DBGCD0_BIT30
#define DBGCD0_BIT7                      DBGCD0_BIT31
#define DBGCD0_BIT0_MASK                 DBGCD0_BIT24_MASK
#define DBGCD0_BIT1_MASK                 DBGCD0_BIT25_MASK
#define DBGCD0_BIT2_MASK                 DBGCD0_BIT26_MASK
#define DBGCD0_BIT3_MASK                 DBGCD0_BIT27_MASK
#define DBGCD0_BIT4_MASK                 DBGCD0_BIT28_MASK
#define DBGCD0_BIT5_MASK                 DBGCD0_BIT29_MASK
#define DBGCD0_BIT6_MASK                 DBGCD0_BIT30_MASK
#define DBGCD0_BIT7_MASK                 DBGCD0_BIT31_MASK
#define DBGCD1_BIT8                      DBGCD1_BIT16
#define DBGCD1_BIT9                      DBGCD1_BIT17
#define DBGCD1_BIT10                     DBGCD1_BIT18
#define DBGCD1_BIT11                     DBGCD1_BIT19
#define DBGCD1_BIT12                     DBGCD1_BIT20
#define DBGCD1_BIT13                     DBGCD1_BIT21
#define DBGCD1_BIT14                     DBGCD1_BIT22
#define DBGCD1_BIT15                     DBGCD1_BIT23
#define DBGCD1_BIT8_MASK                 DBGCD1_BIT16_MASK
#define DBGCD1_BIT9_MASK                 DBGCD1_BIT17_MASK
#define DBGCD1_BIT10_MASK                DBGCD1_BIT18_MASK
#define DBGCD1_BIT11_MASK                DBGCD1_BIT19_MASK
#define DBGCD1_BIT12_MASK                DBGCD1_BIT20_MASK
#define DBGCD1_BIT13_MASK                DBGCD1_BIT21_MASK
#define DBGCD1_BIT14_MASK                DBGCD1_BIT22_MASK
#define DBGCD1_BIT15_MASK                DBGCD1_BIT23_MASK
#define DBGCD2_BIT16                     DBGCD2_BIT8
#define DBGCD2_BIT17                     DBGCD2_BIT9
#define DBGCD2_BIT18                     DBGCD2_BIT10
#define DBGCD2_BIT19                     DBGCD2_BIT11
#define DBGCD2_BIT20                     DBGCD2_BIT12
#define DBGCD2_BIT21                     DBGCD2_BIT13
#define DBGCD2_BIT22                     DBGCD2_BIT14
#define DBGCD2_BIT23                     DBGCD2_BIT15
#define DBGCD2_BIT16_MASK                DBGCD2_BIT8_MASK
#define DBGCD2_BIT17_MASK                DBGCD2_BIT9_MASK
#define DBGCD2_BIT18_MASK                DBGCD2_BIT10_MASK
#define DBGCD2_BIT19_MASK                DBGCD2_BIT11_MASK
#define DBGCD2_BIT20_MASK                DBGCD2_BIT12_MASK
#define DBGCD2_BIT21_MASK                DBGCD2_BIT13_MASK
#define DBGCD2_BIT22_MASK                DBGCD2_BIT14_MASK
#define DBGCD2_BIT23_MASK                DBGCD2_BIT15_MASK
#define DBGCD3_BIT24                     DBGCD3_BIT0
#define DBGCD3_BIT25                     DBGCD3_BIT1
#define DBGCD3_BIT26                     DBGCD3_BIT2
#define DBGCD3_BIT27                     DBGCD3_BIT3
#define DBGCD3_BIT28                     DBGCD3_BIT4
#define DBGCD3_BIT29                     DBGCD3_BIT5
#define DBGCD3_BIT30                     DBGCD3_BIT6
#define DBGCD3_BIT31                     DBGCD3_BIT7
#define DBGCD3_BIT24_MASK                DBGCD3_BIT0_MASK
#define DBGCD3_BIT25_MASK                DBGCD3_BIT1_MASK
#define DBGCD3_BIT26_MASK                DBGCD3_BIT2_MASK
#define DBGCD3_BIT27_MASK                DBGCD3_BIT3_MASK
#define DBGCD3_BIT28_MASK                DBGCD3_BIT4_MASK
#define DBGCD3_BIT29_MASK                DBGCD3_BIT5_MASK
#define DBGCD3_BIT30_MASK                DBGCD3_BIT6_MASK
#define DBGCD3_BIT31_MASK                DBGCD3_BIT7_MASK
#define DBGCDM0_BIT0                     DBGCDM0_BIT24
#define DBGCDM0_BIT1                     DBGCDM0_BIT25
#define DBGCDM0_BIT2                     DBGCDM0_BIT26
#define DBGCDM0_BIT3                     DBGCDM0_BIT27
#define DBGCDM0_BIT4                     DBGCDM0_BIT28
#define DBGCDM0_BIT5                     DBGCDM0_BIT29
#define DBGCDM0_BIT6                     DBGCDM0_BIT30
#define DBGCDM0_BIT7                     DBGCDM0_BIT31
#define DBGCDM0_BIT0_MASK                DBGCDM0_BIT24_MASK
#define DBGCDM0_BIT1_MASK                DBGCDM0_BIT25_MASK
#define DBGCDM0_BIT2_MASK                DBGCDM0_BIT26_MASK
#define DBGCDM0_BIT3_MASK                DBGCDM0_BIT27_MASK
#define DBGCDM0_BIT4_MASK                DBGCDM0_BIT28_MASK
#define DBGCDM0_BIT5_MASK                DBGCDM0_BIT29_MASK
#define DBGCDM0_BIT6_MASK                DBGCDM0_BIT30_MASK
#define DBGCDM0_BIT7_MASK                DBGCDM0_BIT31_MASK
#define DBGCDM1_BIT8                     DBGCDM1_BIT16
#define DBGCDM1_BIT9                     DBGCDM1_BIT17
#define DBGCDM1_BIT10                    DBGCDM1_BIT18
#define DBGCDM1_BIT11                    DBGCDM1_BIT19
#define DBGCDM1_BIT12                    DBGCDM1_BIT20
#define DBGCDM1_BIT13                    DBGCDM1_BIT21
#define DBGCDM1_BIT14                    DBGCDM1_BIT22
#define DBGCDM1_BIT15                    DBGCDM1_BIT23
#define DBGCDM1_BIT8_MASK                DBGCDM1_BIT16_MASK
#define DBGCDM1_BIT9_MASK                DBGCDM1_BIT17_MASK
#define DBGCDM1_BIT10_MASK               DBGCDM1_BIT18_MASK
#define DBGCDM1_BIT11_MASK               DBGCDM1_BIT19_MASK
#define DBGCDM1_BIT12_MASK               DBGCDM1_BIT20_MASK
#define DBGCDM1_BIT13_MASK               DBGCDM1_BIT21_MASK
#define DBGCDM1_BIT14_MASK               DBGCDM1_BIT22_MASK
#define DBGCDM1_BIT15_MASK               DBGCDM1_BIT23_MASK
#define DBGCDM2_BIT16                    DBGCDM2_BIT8
#define DBGCDM2_BIT17                    DBGCDM2_BIT9
#define DBGCDM2_BIT18                    DBGCDM2_BIT10
#define DBGCDM2_BIT19                    DBGCDM2_BIT11
#define DBGCDM2_BIT20                    DBGCDM2_BIT12
#define DBGCDM2_BIT21                    DBGCDM2_BIT13
#define DBGCDM2_BIT22                    DBGCDM2_BIT14
#define DBGCDM2_BIT23                    DBGCDM2_BIT15
#define DBGCDM2_BIT16_MASK               DBGCDM2_BIT8_MASK
#define DBGCDM2_BIT17_MASK               DBGCDM2_BIT9_MASK
#define DBGCDM2_BIT18_MASK               DBGCDM2_BIT10_MASK
#define DBGCDM2_BIT19_MASK               DBGCDM2_BIT11_MASK
#define DBGCDM2_BIT20_MASK               DBGCDM2_BIT12_MASK
#define DBGCDM2_BIT21_MASK               DBGCDM2_BIT13_MASK
#define DBGCDM2_BIT22_MASK               DBGCDM2_BIT14_MASK
#define DBGCDM2_BIT23_MASK               DBGCDM2_BIT15_MASK
#define DBGCDM3_BIT24                    DBGCDM3_BIT0
#define DBGCDM3_BIT25                    DBGCDM3_BIT1
#define DBGCDM3_BIT26                    DBGCDM3_BIT2
#define DBGCDM3_BIT27                    DBGCDM3_BIT3
#define DBGCDM3_BIT28                    DBGCDM3_BIT4
#define DBGCDM3_BIT29                    DBGCDM3_BIT5
#define DBGCDM3_BIT30                    DBGCDM3_BIT6
#define DBGCDM3_BIT31                    DBGCDM3_BIT7
#define DBGCDM3_BIT24_MASK               DBGCDM3_BIT0_MASK
#define DBGCDM3_BIT25_MASK               DBGCDM3_BIT1_MASK
#define DBGCDM3_BIT26_MASK               DBGCDM3_BIT2_MASK
#define DBGCDM3_BIT27_MASK               DBGCDM3_BIT3_MASK
#define DBGCDM3_BIT28_MASK               DBGCDM3_BIT4_MASK
#define DBGCDM3_BIT29_MASK               DBGCDM3_BIT5_MASK
#define DBGCDM3_BIT30_MASK               DBGCDM3_BIT6_MASK
#define DBGCDM3_BIT31_MASK               DBGCDM3_BIT7_MASK

/* **** 05/16/2013 6:38:23 PM  - updates for new silicon revision (V3.0) */

