Karin001/youbeng_can/Project_Headers/mc9s12zvmc128.h
#define SCI0BDH_TNP0                     This_symb_has_been_depreciated
#define SCI0BDH_TNP1                     This_symb_has_been_depreciated
#define SCI0BDH_IREN                     This_symb_has_been_depreciated
#define SCI0BDH_SBR_8                    This_symb_has_been_depreciated
#define SCI0BDH_TNP                      This_symb_has_been_depreciated
#define SCI0BDH_SBR                      This_symb_has_been_depreciated
#define SCI0BDH_TNP0_MASK                This_symb_has_been_depreciated
#define SCI0BDH_TNP1_MASK                This_symb_has_been_depreciated
#define SCI0BDH_IREN_MASK                This_symb_has_been_depreciated
#define SCI0BDH_SBR_8_MASK               This_symb_has_been_depreciated
#define SCI0BDH_SBR_8_BITNUM             This_symb_has_been_depreciated
#define SCI0BDH_TNP_MASK                 This_symb_has_been_depreciated
#define SCI0BDH_TNP_BITNUM               This_symb_has_been_depreciated
#define SCI0BD_TNP0                      This_symb_has_been_depreciated
#define SCI0BD_TNP1                      This_symb_has_been_depreciated
#define SCI0BD_IREN                      This_symb_has_been_depreciated
#define SCI0BD_SBR                       This_symb_has_been_depreciated
#define SCI0BD_TNP                       This_symb_has_been_depreciated
#define SCI0BD_TNP0_MASK                 This_symb_has_been_depreciated
#define SCI0BD_TNP1_MASK                 This_symb_has_been_depreciated
#define SCI0BD_IREN_MASK                 This_symb_has_been_depreciated
#define SCI0BD_SBR_MASK                  This_symb_has_been_depreciated
#define SCI0BD_SBR_BITNUM                This_symb_has_been_depreciated
#define SCI0BD_TNP_MASK                  This_symb_has_been_depreciated
#define SCI0BD_TNP_BITNUM                This_symb_has_been_depreciated
#define SCI1BDH_TNP0                     This_symb_has_been_depreciated
#define SCI1BDH_TNP1                     This_symb_has_been_depreciated
#define SCI1BDH_IREN                     This_symb_has_been_depreciated
#define SCI1BDH_SBR_8                    This_symb_has_been_depreciated
#define SCI1BDH_TNP                      This_symb_has_been_depreciated
#define SCI1BDH_SBR                      This_symb_has_been_depreciated
#define SCI1BDH_TNP0_MASK                This_symb_has_been_depreciated
#define SCI1BDH_TNP1_MASK                This_symb_has_been_depreciated
#define SCI1BDH_IREN_MASK                This_symb_has_been_depreciated
#define SCI1BDH_SBR_8_MASK               This_symb_has_been_depreciated
#define SCI1BDH_SBR_8_BITNUM             This_symb_has_been_depreciated
#define SCI1BDH_TNP_MASK                 This_symb_has_been_depreciated
#define SCI1BDH_TNP_BITNUM               This_symb_has_been_depreciated
#define SCI1BD_TNP0                      This_symb_has_been_depreciated
#define SCI1BD_TNP1                      This_symb_has_been_depreciated
#define SCI1BD_IREN                      This_symb_has_been_depreciated
#define SCI1BD_SBR                       This_symb_has_been_depreciated
#define SCI1BD_TNP                       This_symb_has_been_depreciated
#define SCI1BD_TNP0_MASK                 This_symb_has_been_depreciated
#define SCI1BD_TNP1_MASK                 This_symb_has_been_depreciated
#define SCI1BD_IREN_MASK                 This_symb_has_been_depreciated
#define SCI1BD_SBR_MASK                  This_symb_has_been_depreciated
#define SCI1BD_SBR_BITNUM                This_symb_has_been_depreciated
#define SCI1BD_TNP_MASK                  This_symb_has_been_depreciated
#define SCI1BD_TNP_BITNUM                This_symb_has_been_depreciated

/*lint -restore  +esym(960,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
#endif
